# St7GetCavityFluidLayoutNumByIndex

Returns the cavity fluid layout number associated with the specified layout index. The cavity fluid layout indices
are stored internally and are based on a contiguous numbering system.

long St7GetCavityFluidLayoutNumByIndex(long uID, long Index, long* CavityID)

Input Parameters

uID

Strand7 model file ID.

Index

Cavity fluid layout index.

Output Parameters
CavityID

Cavity fluid layout ID.